iter1_hbase/output/hbase_load_a_200000.txt
[WARN]  The 'hbase10' client has been deprecated because HBase 1.0 is EOM. If you are using HBase 1.2+ try using the 'hbase12' client instead.
java -cp /usr/local/ycsb-0.14.0/hbase10-binding/conf:/usr/local/ycsb-0.14.0/conf:/usr/local/ycsb-0.14.0/lib/HdrHistogram-2.1.4.jar:/usr/local/ycsb-0.14.0/lib/jackson-core-asl-1.9.4.jar:/usr/local/ycsb-0.14.0/lib/core-0.14.0.jar:/usr/local/ycsb-0.14.0/lib/jackson-mapper-asl-1.9.4.jar:/usr/local/ycsb-0.14.0/lib/htrace-core4-4.1.0-incubating.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/protobuf-java-2.5.0.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/commons-compress-1.4.1.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/paranamer-2.3.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/findbugs-annotations-1.3.9-1.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/commons-lang-2.6.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/commons-httpclient-3.1.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/jaxb-api-2.2.2.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/htrace-core-3.1.0-incubating.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/api-util-1.0.0-M20.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/commons-net-3.1.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/log4j-1.2.17.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/jcodings-1.0.8.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/commons-codec-1.9.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/hadoop-auth-2.5.1.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/commons-logging-1.2.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/commons-cli-1.2.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/jetty-util-6.1.26.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/apacheds-kerberos-codec-2.0.0-M15.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/hbase-annotations-1.0.2.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/jackson-mapper-asl-1.8.8.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/netty-all-4.0.23.Final.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/apacheds-i18n-2.0.0-M15.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/httpcore-4.2.4.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/commons-math3-3.1.1.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/hbase-protocol-1.0.2.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/hadoop-common-2.5.1.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/guava-12.0.1.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/commons-el-1.0.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/activation-1.1.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/hadoop-annotations-2.5.1.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/commons-collections-3.2.1.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/slf4j-api-1.7.25.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/hadoop-mapreduce-client-core-2.5.1.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/hadoop-yarn-common-2.5.1.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/jackson-core-asl-1.9.4.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/jsr305-1.3.9.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/slf4j-log4j12-1.7.7.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/commons-configuration-1.6.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/commons-beanutils-1.7.0.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/commons-digester-1.8.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/avro-1.7.4.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/xz-1.0.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/snappy-java-1.0.4.1.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/commons-io-2.4.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/joni-2.1.2.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/hbase-client-1.0.2.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/hbase10-binding-0.14.0.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/netty-3.6.2.Final.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/hbase-common-1.0.2.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/httpclient-4.2.5.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/jsch-0.1.42.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/hadoop-yarn-api-2.5.1.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/xmlenc-0.52.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/commons-beanutils-core-1.8.0.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/api-asn1-api-1.0.0-M20.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/stax-api-1.0-2.jar:/usr/local/ycsb-0.14.0/hbase10-binding/lib/zookeeper-3.4.6.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.HBaseClient10 -s -P workloads/workloada -p recordcount=200000 -p table=usertable -p columnfamily=family -load
Command line: -db com.yahoo.ycsb.db.HBaseClient10 -s -P workloads/workloada -p recordcount=200000 -p table=usertable -p columnfamily=family -load
YCSB Client 0.14.0

Loading workload...
log4j:WARN No appenders could be found for logger (org.apache.htrace.core.Tracer).
log4j:WARN Please initialize the log4j system properly.
log4j:WARN See http://logging.apache.org/log4j/1.2/faq.html#noconfig for more info.
Starting test.
2018-12-19 05:12:46:297 0 sec: 0 operations; est completion in 0 second 
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2018-12-19 05:12:56:275 10 sec: 11618 operations; 1161.8 current ops/sec; est completion in 2 minutes [INSERT: Count=11618, Max=117631, Min=408, Avg=754.41, 90=909, 99=4595, 99.9=9631, 99.99=14087] 
2018-12-19 05:13:06:275 20 sec: 27080 operations; 1546.2 current ops/sec; est completion in 2 minutes [INSERT: Count=15462, Max=1361919, Min=376, Avg=640.52, 90=595, 99=1616, 99.9=7939, 99.99=13495] 
2018-12-19 05:13:16:275 30 sec: 47360 operations; 2028 current ops/sec; est completion in 1 minute [INSERT: Count=20280, Max=13679, Min=377, Avg=489.09, 90=499, 99=679, 99.9=5623, 99.99=8067] 
2018-12-19 05:13:26:275 40 sec: 65601 operations; 1824.1 current ops/sec; est completion in 1 minute [INSERT: Count=18241, Max=675327, Min=362, Avg=543.81, 90=534, 99=1146, 99.9=7259, 99.99=21391] 
2018-12-19 05:13:36:275 50 sec: 83317 operations; 1771.6 current ops/sec; est completion in 1 minute [INSERT: Count=17716, Max=12063, Min=353, Avg=560.6, 90=616, 99=1240, 99.9=6631, 99.99=9895] 
2018-12-19 05:13:46:275 60 sec: 101291 operations; 1797.4 current ops/sec; est completion in 59 seconds [INSERT: Count=17974, Max=84479, Min=336, Avg=552.58, 90=616, 99=1044, 99.9=7419, 99.99=14015] 
2018-12-19 05:13:56:275 70 sec: 117128 operations; 1583.7 current ops/sec; est completion in 50 seconds [INSERT: Count=15837, Max=766463, Min=365, Avg=627.42, 90=646, 99=1248, 99.9=8287, 99.99=20431] 
2018-12-19 05:14:06:275 80 sec: 134882 operations; 1775.4 current ops/sec; est completion in 39 seconds [INSERT: Count=17754, Max=202367, Min=333, Avg=559.78, 90=600, 99=1670, 99.9=6783, 99.99=13279] 
2018-12-19 05:14:16:275 90 sec: 147322 operations; 1244 current ops/sec; est completion in 33 seconds [INSERT: Count=12440, Max=10791, Min=337, Avg=570.05, 90=637, 99=1503, 99.9=6807, 99.99=10719] 
2018-12-19 05:14:26:275 100 sec: 147322 operations; 0 current ops/sec; est completion in 36 seconds [INSERT: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2018-12-19 05:14:36:278 110 sec: 153851 operations; 652.7 current ops/sec; est completion in 33 seconds [INSERT: Count=6529, Max=18317311, Min=367, Avg=3498.17, 90=771, 99=4171, 99.9=15319, 99.99=27407] 
2018-12-19 05:14:46:275 120 sec: 171258 operations; 1741.22 current ops/sec; est completion in 21 seconds [INSERT: Count=17407, Max=12871, Min=379, Avg=570.52, 90=613, 99=1202, 99.9=6747, 99.99=11351] 
2018-12-19 05:14:56:275 130 sec: 189407 operations; 1814.9 current ops/sec; est completion in 8 second [INSERT: Count=18149, Max=18271, Min=372, Avg=547.35, 90=592, 99=975, 99.9=7299, 99.99=11887] 
2018-12-19 05:15:02:874 136 sec: 200000 operations; 1605.49 current ops/sec; [CLEANUP: Count=2, Max=539647, Min=28, Avg=269710, 90=539647, 99=539647, 99.9=539647, 99.99=539647] [INSERT: Count=10593, Max=11135, Min=372, Avg=568.44, 90=608, 99=953, 99.9=6895, 99.99=8871] 
[OVERALL], RunTime(ms), 136599
[OVERALL], Throughput(ops/sec), 1464.1395617830292
[TOTAL_GCS_PS_Scavenge], Count, 150
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 460
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.3367520992100967
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 150
[TOTAL_GC_TIME], Time(ms), 460
[TOTAL_GC_TIME_%], Time(%), 0.3367520992100967
[CLEANUP], Operations, 2
[CLEANUP], AverageLatency(us), 269710.0
[CLEANUP], MinLatency(us), 28
[CLEANUP], MaxLatency(us), 539647
[CLEANUP], 95thPercentileLatency(us), 539647
[CLEANUP], 99thPercentileLatency(us), 539647
[INSERT], Operations, 200000
[INSERT], AverageLatency(us), 670.314405
[INSERT], MinLatency(us), 333
[INSERT], MaxLatency(us), 18317311
[INSERT], 95thPercentileLatency(us), 706
[INSERT], 99thPercentileLatency(us), 1872
[INSERT], Return=OK, 200000